Repository: ajdotnet/AJ.Console
Catalog: AJ.Console/ConsoleApp.*.resx
Languages: de_de

# Logo
source: Application based on AJ.Console (c) by Alexander Jung - https://github.com/ajdotnet/AJ.Console
de_de: Application basierend aif AJ.Console (c) Alexander Jung - https://github.com/ajdotnet/AJ.Console

# Syntax
source: (no syntax specified)
de_de: (Keine Syntax spezifiziert.)

# SystemParameters
source: System parameter: @parameterfile read arguments from file !logfile write output also to log file /?|/h[help] show help /v[erbose] show verbose output /q[uiet] show no output /nologo show no logo
de_de: Systemparameter: @Parameterdatei Arguments aus einer Datei einlesen !Logdatei In eine Logdatei schreiben /?|/h[elp] Hilfe anzeigen /v[erbose] Ausführliche Ausgabe /q[uiet] Keine Ausgabe /nologo Kein Logo ausgeben

# Error
source: Use /? for further information.
de_de: /? für weitere Information.

# Help
source: No further help available.
de_de: Keine weitere Information verfügbar.

# Ex.CouldNotReadParameterFile
source: The parameter file '{0}' could no be read.
de_de: Die Parameterdatei '{0}' konnte nicht gelesen werden.

# Ex.InvalidArgumentsNull
source: Invalid argument: {0} is NULL.
de_de: Fehlende Argumente: {0} ist nicht vorhanden.

# Ex.InvalidArgumentsMin
source: Invalid number of argument: {0} needs at least {1} value(s).
de_de: Ungültige Anzahl von Argumenten: {0} benötigt mindestens {1} Argument(e).

# Ex.InvalidArgumentsMax
source: Invalid number of argument: {0} supports {1} value(s) at most.
de_de: Ungültige Anzahl von Argumenten: {0} unterstützt höchstens {1} Argumente(e).

# Ex.UnknownSwitch
source: Unknown switch: {0}
de_de: Unbekannter Schalter: {0}

# Ex.InvalidArguments
source: Invalid arguments: {0}
de_de: Ungültiges Argument: {0}

# Ex.LogfileCouldNotBeOpened
source: The log file '{0}' could no be opened.
de_de: Die Logdatei '{0}' nicht geöffnet werden.
